import matplotlib.pylab as plt

x = []
for i in range(-1,21):
    x.append(i)

# 在这里修改数据，依次是365nm,405nm,436nm,546nm,577nm对应的电流值
y1 = [0.71, 2.1, 3.9, 5.95, 8.15, 10.8, 14, 16.85, 19.5, 22.3, 24.8, 26.9, 29, 31.1, 33.3, 35.3, 37.5, 39.6, 41.4, 43.4, 45.2, 47.2]
y2 = [-0.02, 0.83, 2.2, 3.7, 5.7, 7.55, 9.2, 10.7, 12.15, 13.25, 14.55, 15.55, 16.8, 18, 19.1, 20.1, 21.3, 22.2, 23.4, 24.5, 25.5, 26.5]
y3 = [-1, 1, 3.26, 6, 9.4, 13, 17.1, 20.6, 23.5, 26.4, 29.5, 32.5, 35.1, 37.6, 40.4, 43.2, 45.8, 48.5, 51, 53.4, 56, 58.6]
y4 = [-0.02, -0.01, 0.82, 1.8, 2.75, 3.44, 4, 4.55, 5.1, 5.5, 5.9, 6.33, 6.78, 7.12, 7.47, 7.8, 8.21, 8.5, 8.9, 9.25, 9.4, 9.73]
y5 = [0, 0, 0.47, 1.03, 1.45, 1.76, 1.95, 2.35, 2.55, 2.75, 2.95, 3.13, 3.3, 3.48, 3.62, 3.81, 3.92, 4.08, 4.2, 4.3, 4.43, 4.55]

tags = ['365nm','405nm','436nm','546nm','577nm']

plt.plot(x, y1, label=tags[0])
plt.plot(x, y2, label=tags[1])
plt.plot(x, y3, label=tags[2])
plt.plot(x, y4, label=tags[3])
plt.plot(x, y5, label=tags[4])
plt.legend(loc='upper left')

# 在这里修改坐标轴范围
plt.xticks(range(-1,21))
plt.yticks(range(0, 60, 5))
plt.grid(True)

plt.xlabel('Voltage (V)')
plt.ylabel('Current (10^-11 A)')
plt.ylim(bottom=0)
plt.show()







